
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолеВыбораТипаДиаграммы = ТипДиаграммы.Гистограмма;
	Диаграмма.ТипДиаграммы = ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораТипаДиаграммыПриИзменении(Элемент)
	Диаграмма.ТипДиаграммы = ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьДиаграммуНаСервере()
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Наименование КАК Наименование,
	|	Сотрудники.ЗаработнаяПлата КАК ЗаработнаяПлата
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа
	|	И НЕ Сотрудники.ЗаработнаяПлата = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаработнаяПлата";
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	Диаграмма.Обновление = ЛОЖЬ;
	Диаграмма.АвтоТранспонирование = ЛОЖЬ;
	ТочкаДиаграммы = Диаграмма.УстановитьТочку("ЗаработнаяПлата");
	Пока ВыборкаДанных.Следующий() Цикл
		ТекущаяСерияДиаграммы = Диаграмма.УстановитьСерию(ВыборкаДанных.Наименование);
		Диаграмма.УстановитьЗначение(ТочкаДиаграммы, ТекущаяСерияДиаграммы, ВыборкаДанных.ЗаработнаяПлата);
	КонецЦикла;
	Диаграмма.Обновление = ИСТИНА;
	Диаграмма.АвтоТранспонирование = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьДиаграмму(Команда)
	КомандаСформироватьДиаграммуНаСервере();
КонецПроцедуры
