
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тил выходных данных
	Табдок.Очистить(); // очищаем на случай повторной формировки
	Табдок.ТолькоПросмотр = Истина; //даем право только на просмотр

	//2. Получаем созданный ранее макет с помощью вспомогательной процедуры:
	Макет = ПолучитьМакетНаСервере("Макет");

	//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	Табдок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);                          
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанных"); 
	                                                     
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
    "ВЫБРАТЬ
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Период КАК Дата,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Студент КАК Студент,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяВозвращенияВОбщежитие КАК ВремяВозвращения,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяУходаИзОбщежития КАК ВремяУхода
    |ИЗ
    |	РегистрСведений.ВремяУходаИПриходаПроживающих.СрезПоследних(&ДатаОтчета, ) КАК ВремяУходаИПриходаПроживающихСрезПоследних
    |
    |СГРУППИРОВАТЬ ПО
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Студент,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.Период,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяВозвращенияВОбщежитие,
    |	ВремяУходаИПриходаПроживающихСрезПоследних.ВремяУходаИзОбщежития
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата,
    |	ВремяУхода";                                     	
	ЗапросДанных.УстановитьПараметр("ДатаОтчета",КонецДня(ЭтаФорма.ДатаОтчета));
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл            
		ОбластьДанные.Параметры.Студент = ВыборкаДанных.Студент;
		ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;
		ОбластьДанные.Параметры.ВремяУхода = ВыборкаДанных.ВремяУхода;
		ОбластьДанные.Параметры.ВремяВозвращения = ВыборкаДанных.ВремяВозвращения;

		Табдок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции