&НаКлиенте
Процедура ТЧ_ВыплатыСотрудникПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Выплаты.ТекущиеДанные;
	
	ТекущаяСтрока.Должность = ПолучениеДолжностиСотр(ТекущаяСтрока.Сотрудник);
КонецПроцедуры  

&НаСервере
Функция Получение_ЗП(Сотрудник)
	Сотрудник_ЗП = Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник);
	Результат = Сотрудник_ЗП.ЗаработнаяПлата;  
	Если Результат = 0 Тогда
		Сообщить("У сотрудника: " + Сотрудник + "не указана зароботная плата, добавьте её в разделе 'Сотрудники'");
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПолучениеДолжностиСотр(Сотрудник)
	Сотрудник_Дол = Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник);
	Результат = Сотрудник_Дол.Должность;  	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_Выплаты.Итог("Зарплата");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ВыплатыВидРасчетаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Выплаты.ТекущиеДанные;
	ТекущаяСтрока.Зарплата = Получение_ЗП(ТекущаяСтрока.Сотрудник);
	Премия = ПредопределенноеЗначение("ПланВидовРасчета.ОсновныеНачисления.Премия");
	Невыход = ПредопределенноеЗначение("ПланВидовРасчета.ОсновныеНачисления.Невыход");
    Больничный = ПредопределенноеЗначение("ПланВидовРасчета.ОсновныеНачисления.Больничный");
	Если ТекущаяСтрока.ВидРасчета = Премия тогда
		ТекущаяСтрока.Зарплата = 0;
	ИначеЕсли ТекущаяСтрока.ВидРасчета = Больничный тогда
		ТекущаяСтрока.Зарплата = 0;
	ИначеЕсли ТекущаяСтрока.ВидРасчета = Невыход тогда
		ТекущаяСтрока.Зарплата = 0;
	КонецЕсли;
	
КонецПроцедуры
