
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Движения.Инвентарь.Записывать = Истина;   
	ОстаткиТов = РегистрыНакопления.Инвентарь;  
	Для Каждого ТекСтрокаТЧ_СломаноУтеряно Из ТЧ_СломаноУтеряно Цикл 
	// Создаем вспомогательные переменные 
		ТекТовар = ТекСтрокаТЧ_СломаноУтеряно.Номенклатура;
	// Настраиваем отбор
		ОтборТов = Новый Структура();
		ОтборТов.Вставить("Номенклатура",ТекТовар);
		//  Формируем таблицу остатков и записываем остаточное количество товара на складе
	    ТаблицаОстатков = ОстаткиТов.Остатки(МоментВремени(),ОтборТов,"Номенклатура","Количество");
		Остаток =  ТаблицаОстатков.Итог("Количество");
	Если Остаток >= ТекСтрокаТЧ_СломаноУтеряно.Количество Тогда
		Движение = Движения.Инвентарь.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_СломаноУтеряно.Номенклатура;
		Движение.НаборСвойств = ТекСтрокаТЧ_СломаноУтеряно.НаборСвойств;
		Движение.Количество = ТекСтрокаТЧ_СломаноУтеряно.Количество;
		Движение.Сумма = ТекСтрокаТЧ_СломаноУтеряно.Сумма;	
	Иначе
		Сообщить("Недостаточно товара: " + ТекТовар + "! Документ не проводится");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_СломаноУтеряно Из ТЧ_СломаноУтеряно Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.ОсновныеСредства;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПокупателями;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_СломаноУтеряно.Сумма;
		Движение.КоличествоДт = ТекСтрокаТЧ_СломаноУтеряно.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_СломаноУтеряно.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Общежитие] = Общежитие;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
