
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОплатаЗаПовережденноеИмуществоОбщежития.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Дата,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Номер,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Общежитие,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.СотрудникЗаполняющийДокумент,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Студент,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.СуммаДокумента,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.ТипОплаты,
	|	ОплатаЗаПовережденноеИмуществоОбщежития.ТЧ_ИспорченноеИмущество.(
	|		НомерСтроки,
	|		Материал,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОплатаЗаПовережденноеИмуществоОбщежития КАК ОплатаЗаПовережденноеИмуществоОбщежития
	|ГДЕ
	|	ОплатаЗаПовережденноеИмуществоОбщежития.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ИспорченноеИмуществоШапка = Макет.ПолучитьОбласть("ТЧ_ИспорченноеИмуществоШапка");
	ОбластьТЧ_ИспорченноеИмущество = Макет.ПолучитьОбласть("ТЧ_ИспорченноеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ИспорченноеИмуществоШапка);
		ВыборкаТЧ_ИспорченноеИмущество = Выборка.ТЧ_ИспорченноеИмущество.Выбрать();
		Пока ВыборкаТЧ_ИспорченноеИмущество.Следующий() Цикл
			ОбластьТЧ_ИспорченноеИмущество.Параметры.Заполнить(ВыборкаТЧ_ИспорченноеИмущество);
			ТабДок.Вывести(ОбластьТЧ_ИспорченноеИмущество, ВыборкаТЧ_ИспорченноеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
