
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ИспорченноеИмущество Из ТЧ_ИспорченноеИмущество Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.ОсновныеСредства;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_ИспорченноеИмущество.Сумма;
		Движение.КоличествоКт = ТекСтрокаТЧ_ИспорченноеИмущество.Количество;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_ИспорченноеИмущество.Материал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Общежитие] = Общежитие;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Студент] = Платильщик;

	// регистр ОплатаПоврежденногоИмущества 
	Движения.ОплатаПоврежденногоИмущества.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ИспорченноеИмущество Из ТЧ_ИспорченноеИмущество Цикл
		Движение = Движения.ОплатаПоврежденногоИмущества.Добавить();
		Движение.Период = Дата;
		Движение.Плательщик = Платильщик;
		Движение.Сумма = СуммаДокумента;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Студенты") Тогда
		// Заполнение шапки
		Платильщик = ДанныеЗаполнения.Ссылка;
		Общежитие = ДанныеЗаполнения.Общежитие;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
