
&НаКлиенте
Процедура ТЧ_ИспорченноеИмуществоМатериалПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ИспорченноеИмущество.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Материал);
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ИспорченноеИмуществоЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ИспорченноеИмущество.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ИспорченноеИмущество.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ИспорченноеИмуществоКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ИспорченноеИмущество.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ИспорченноеИмущество.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_ИспорченноеИмущество.Итог("Сумма");
КонецПроцедуры 

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции
