
&НаКлиенте
Процедура ТЧ_СломаноУтеряноНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Номенклатура);
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_СломаноУтеряно.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СломаноУтеряноКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_СломаноУтеряно.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СломаноУтеряноЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ПереченьНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженыНесоответствияПриИзменении(Элемент)
	Если Объект.ОбнаруженыНесоответствия Тогда
		Элементы.Студент.Видимость = Истина;
		Элементы.ТЧ_СломаноУтеряно.Видимость = Истина;
	Иначе
		Элементы.Студент.Видимость = Ложь;
		Элементы.ТЧ_СломаноУтеряно.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
