
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПокупкаИнвентаря.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПокупкаИнвентаря.ВидОплаты,
	|	ПокупкаИнвентаря.Дата,
	|	ПокупкаИнвентаря.Клиент,
	|	ПокупкаИнвентаря.Номер,
	|	ПокупкаИнвентаря.СуммаДокумента,
	|	ПокупкаИнвентаря.ТЧ_ПереченьНоменклатура.(
	|		НомерСтроки,
	|		Материал,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПокупкаИнвентаря КАК ПокупкаИнвентаря
	|ГДЕ
	|	ПокупкаИнвентаря.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ПереченьНоменклатураШапка = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатураШапка");
	ОбластьТЧ_ПереченьНоменклатура = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатура");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатураШапка);
		ВыборкаТЧ_ПереченьНоменклатура = Выборка.ТЧ_ПереченьНоменклатура.Выбрать();
		Пока ВыборкаТЧ_ПереченьНоменклатура.Следующий() Цикл
			ОбластьТЧ_ПереченьНоменклатура.Параметры.Заполнить(ВыборкаТЧ_ПереченьНоменклатура);
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатура, ВыборкаТЧ_ПереченьНоменклатура.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
