
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Закупки 
	Движения.Закупки.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатура Из ТЧ_ПереченьНоменклатура Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_ПереченьНоменклатура.Материал;
		Движение.Контрагент = Клиент;
		Движение.Количество = ТекСтрокаТЧ_ПереченьНоменклатура.Количество;
		Движение.Стоимость = СуммаДокумента;
	КонецЦикла;

	// регистр Инвентарь Приход
	Движения.Инвентарь.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатура Из ТЧ_ПереченьНоменклатура Цикл
		Движение = Движения.Инвентарь.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТЧ_ПереченьНоменклатура.Материал;
		Движение.Количество = ТекСтрокаТЧ_ПереченьНоменклатура.Количество;
		Движение.Сумма = ТекСтрокаТЧ_ПереченьНоменклатура.Сумма;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ПереченьНоменклатура Из ТЧ_ПереченьНоменклатура Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.ОсновныеСредства;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСПоставщиками;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_ПереченьНоменклатура.Сумма;
		Движение.КоличествоДт = ТекСтрокаТЧ_ПереченьНоменклатура.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_ПереченьНоменклатура.Материал;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Общежитие] = Клиент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
