
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тил выходных данных
	Табдок.Очистить(); // очищаем на случай повторной формировки
	Табдок.ТолькоПросмотр = Истина; //даем право только на просмотр

	//2. Получаем созданный ранее макет с помощью вспомогательной процедуры:
	Макет = ПолучитьМакетНаСервере("Макет");

	//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	Табдок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);

	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");  
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
    "ВЫБРАТЬ
    |	ЗачислениеПроживающего.Ссылка КАК Ссылка,
    |	ЗачислениеПроживающего.Дата КАК Дата,
    |	ЗачислениеПроживающего.Номер КАК Номер,
    |	ЗачислениеПроживающего.Пол КАК Пол,
    |	ЗачислениеПроживающего.ДатаРождения КАК ДатаРождения,
    |	ЗачислениеПроживающего.КурсОбучения КАК КурсОбучения,
    |	ЗачислениеПроживающего.Наименование КАК Наименование
    |ИЗ
    |	Документ.ЗачислениеПроживающего КАК ЗачислениеПроживающего
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата,
    |	Ссылка";
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;
		ОбластьДанные.Параметры.Номер = ВыборкаДанных.Номер;
		ОбластьДанные.Параметры.Студент = ВыборкаДанных.Наименование;
		ОбластьДанные.Параметры.ДатаРождения = ВыборкаДанных.ДатаРождения;
		ОбластьДанные.Параметры.Пол = ВыборкаДанных.Пол;
		ОбластьДанные.Параметры.КурсОбучения = ВыборкаДанных.КурсОбучения;
		Табдок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции