
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОплатаПроживания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаПроживания.Дата,
	|	ОплатаПроживания.Номер,
	|	ОплатаПроживания.СотрудникЗаполняющийДокумент,
	|	ОплатаПроживания.СуммаДокумента,
	|	ОплатаПроживания.ТипОплаты,
	|	ОплатаПроживания.ФинансовыйТипОбучения,
	|	ОплатаПроживания.ТЧ_ОплатаОбучения.(
	|		НомерСтроки,
	|		Студент,
	|		ОбразовательнаяОрганизация,
	|		Общежитие,
	|		ОплатаПроживания
	|	)
	|ИЗ
	|	Документ.ОплатаПроживания КАК ОплатаПроживания
	|ГДЕ
	|	ОплатаПроживания.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ОплатаОбученияШапка = Макет.ПолучитьОбласть("ТЧ_ОплатаОбученияШапка");
	ОбластьТЧ_ОплатаОбучения = Макет.ПолучитьОбласть("ТЧ_ОплатаОбучения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ОплатаОбученияШапка);
		ВыборкаТЧ_ОплатаОбучения = Выборка.ТЧ_ОплатаОбучения.Выбрать();
		Пока ВыборкаТЧ_ОплатаОбучения.Следующий() Цикл
			ОбластьТЧ_ОплатаОбучения.Параметры.Заполнить(ВыборкаТЧ_ОплатаОбучения);
			ТабДок.Вывести(ОбластьТЧ_ОплатаОбучения, ВыборкаТЧ_ОплатаОбучения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
