
&НаКлиенте
Процедура ТЧ_ПереченьНоменклатураМатериалПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ПереченьНоменклатура.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Материал);
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_ПереченьНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПереченьНоменклатураКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ПереченьНоменклатура.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ПереченьНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПереченьНоменклатураЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_ПереченьНоменклатура.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ПереченьНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции