
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УслугиНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_Услуги.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Номенклатура);
КонецПроцедуры 

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции  

