
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВыплатаЗарплат.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатаЗарплат.Дата,
	|	ВыплатаЗарплат.Номер,
	|	ВыплатаЗарплат.СотрудникЗаполняющийДокумент,
	|	ВыплатаЗарплат.СуммаДокумента,
	|	ВыплатаЗарплат.ТЧ_Выплаты.(
	|		НомерСтроки,
	|		Сотрудник,
	|		ТипОплаты,
	|		Зарплата,
	|		Должность
	|	)
	|ИЗ
	|	Документ.ВыплатаЗарплат КАК ВыплатаЗарплат
	|ГДЕ
	|	ВыплатаЗарплат.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ВыплатыШапка = Макет.ПолучитьОбласть("ТЧ_ВыплатыШапка");
	ОбластьТЧ_Выплаты = Макет.ПолучитьОбласть("ТЧ_Выплаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ВыплатыШапка);
		ВыборкаТЧ_Выплаты = Выборка.ТЧ_Выплаты.Выбрать();
		Пока ВыборкаТЧ_Выплаты.Следующий() Цикл
			ОбластьТЧ_Выплаты.Параметры.Заполнить(ВыборкаТЧ_Выплаты);
			ТабДок.Вывести(ОбластьТЧ_Выплаты, ВыборкаТЧ_Выплаты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
