
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетЗаработныхВыплат 
	Движения.УчетЗаработныхВыплат.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Выплаты Из ТЧ_Выплаты Цикл
		Движение = Движения.УчетЗаработныхВыплат.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаТЧ_Выплаты.Сотрудник;
		Движение.Зарплата = ТекСтрокаТЧ_Выплаты.Зарплата;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Выплаты Из ТЧ_Выплаты Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.РасчетыСсотрудникамиПоОплатеТруда;
		Движение.СчетКт = ПланыСчетов.Основной.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_Выплаты.Зарплата;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = ТекСтрокаТЧ_Выплаты.Сотрудник;
	КонецЦикла;

	// регистр Начисления
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Выплаты Из ТЧ_Выплаты Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаТЧ_Выплаты.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаТЧ_Выплаты.ДатаНачала;
		Движение.ПериодДействияКонец = КонецДня(ТекСтрокаТЧ_Выплаты.ДатаОкончания);
		Движение.ПериодРегистрации = ТекСтрокаТЧ_Выплаты.ДатаНачала;
		Движение.БазовыйПериодНачало = ТекСтрокаТЧ_Выплаты.ДатаНачала;
		Движение.БазовыйПериодКонец = КонецДня(ТекСтрокаТЧ_Выплаты.ДатаОкончания);
		Движение.Сотрудник = ТекСтрокаТЧ_Выплаты.Сотрудник;
		Движение.ГрафикРаботы = ТекСтрокаТЧ_Выплаты.ГрафикРаботы;
		Движение.ИсходныеДанные = ТекСтрокаТЧ_Выплаты.Зарплата;
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыплатаЗарплат.Сотрудник
	|ИЗ
	|	Документ.ВыплатаЗарплат.ТЧ_Выплаты КАК ВыплатаЗарплат
	|ГДЕ
	|	ВыплатаЗарплат.Ссылка = &ТекущийДокумент");
	
	Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка);
	
	
	ТаблЗнач = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = ТаблЗнач.ВыгрузитьКолонку("Сотрудник");
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Больничный, МассивСотрудников);
	Движения.Начисления.Записать(, Истина);
	
	
	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Оклад, МассивСотрудников);
	Движения.Начисления.Записать(, Истина);
	

	РассчитатьНачисления(Движения.Начисления, ПланыВидовРасчета.ОсновныеНачисления.Премия, МассивСотрудников);
	Движения.Начисления.Записать(, Истина);
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
