
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОказаниеУслуги.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОказаниеУслуги.ВидОплаты,
	|	ОказаниеУслуги.Дата,
	|	ОказаниеУслуги.Клиент,
	|	ОказаниеУслуги.Мастер,
	|	ОказаниеУслуги.Номер,
	|	ОказаниеУслуги.СуммаДокумента,
	|	ОказаниеУслуги.Ссылка,
	|	ОказаниеУслуги.ТЧ_ПереченьНоменклатура.(
	|		НомерСтроки,
	|		Материал,
	|		Материал.Ссылка КАК Ссылка,
	|		Количество,
	|	),
	|	ОказаниеУслуги.ТЧ_Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.Ссылка КАК Ссылка,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ОказаниеУслуги КАК ОказаниеУслуги
	|ГДЕ
	|	ОказаниеУслуги.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ПереченьНоменклатураШапка = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатураШапка");
	ОбластьТЧ_ПереченьНоменклатура = Макет.ПолучитьОбласть("ТЧ_ПереченьНоменклатура");
	ОбластьТЧ_УслугиШапка = Макет.ПолучитьОбласть("ТЧ_УслугиШапка");
	ОбластьТЧ_Услуги = Макет.ПолучитьОбласть("ТЧ_Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		СсылкаНаДок = Выборка.Ссылка;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если СсылкаНаДок.ТЧ_ПереченьНоменклатура.Количество() > 0 тогда
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатураШапка);
		КонецЕсли;
		
		ВыборкаТЧ_ПереченьНоменклатура = Выборка.ТЧ_ПереченьНоменклатура.Выбрать();
		Пока ВыборкаТЧ_ПереченьНоменклатура.Следующий() Цикл
			ОбластьТЧ_ПереченьНоменклатура.Параметры.Заполнить(ВыборкаТЧ_ПереченьНоменклатура);
			ТабДок.Вывести(ОбластьТЧ_ПереченьНоменклатура, ВыборкаТЧ_ПереченьНоменклатура.Уровень());
		КонецЦикла;

		Если СсылкаНаДок.ТЧ_Услуги.Количество() > 0 тогда
			ТабДок.Вывести(ОбластьТЧ_УслугиШапка);
		КонецЕсли;
		
		ВыборкаТЧ_Услуги = Выборка.ТЧ_Услуги.Выбрать();
		Пока ВыборкаТЧ_Услуги.Следующий() Цикл
			ОбластьТЧ_Услуги.Параметры.Заполнить(ВыборкаТЧ_Услуги);
			ТабДок.Вывести(ОбластьТЧ_Услуги, ВыборкаТЧ_Услуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
