&НаСервере
Функция РозничнаяЦена(АктуальнаяДата, Номенклатура) Экспорт  
	Отбор = Новый Структура("Номенклатура",Номенклатура);  
	Результат = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Результат.Цена;
КонецФункции  

&НаСервере
Функция Себестоимость(АктуальнаяДата, Номенклатура) Экспорт  
	Отбор = Новый Структура("Номенклатура",Номенклатура);  
	Результат = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Результат.Цена;
КонецФункции   

&НаСервере
Функция ЗП_Сотрудника(Сотрудник) Экспорт  
	Отбор = Новый Структура("Сотрудник",Сотрудник);  
	Результат = Справочники.Сотрудники.ПолучитьДанныеВыбора(Отбор);
	Сообщить(Результат);
	Возврат Результат.ЗаработнаяПлата;
КонецФункции