
&НаКлиенте
Процедура ОтборСтудентЗначениеПриИзменении(Элемент)
	УстановитьОтборПоСтудентам();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтудентФлагПриИзменении(Элемент)
	ЭтаФорма.ОтборДатаФлаг = ЛОЖЬ;
	УстановитьОтборПоСтудентам();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаЗначениеПриИзменении(Элемент)
	УстановитьОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаФлагПриИзменении(Элемент)
	ЭтаФорма.ОтборСтудентФлаг = ЛОЖЬ;
	УстановитьОтборПоДате();
КонецПроцедуры

&НаКлиенте
 Процедура УстановитьОтборПоСтудентам() 
	 Список.Отбор.Элементы.Очистить();
	 
	 ЭлементОтбораСтудент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	 ЭлементОтбораСтудент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Студент");
	 ЭлементОтбораСтудент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	 ЭлементОтбораСтудент.ПравоеЗначение = ЭтаФорма.ОтборСтудентЗначение;
	 
	 Если ЭтаФорма.ОтборСтудентФлаг Тогда
		 ЭлементОтбораСтудент.Использование = Истина;
	 Иначе 
		 ЭлементОтбораСтудент.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
 Процедура УстановитьОтборПоДате() 
	 Список.Отбор.Элементы.Очистить();
	 
	 ЭлементОтбораДата = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	 ЭлементОтбораДата.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("День");
	 ЭлементОтбораДата.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	 ЭлементОтбораДата.ПравоеЗначение = ЭтаФорма.ОтборДатаЗначение;
	 
	 Если ЭтаФорма.ОтборДатаФлаг Тогда
		 ЭлементОтбораДата.Использование = Истина;
	 Иначе 
		 ЭлементОтбораДата.Использование = Ложь;
	КонецЕсли;
КонецПроцедуры